Revit 2026 API

# StructuralConnectionHandlerTypeRemoveMainSubelementsFromCustomConnection Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")]
public static void RemoveMainSubelementsFromCustomConnection(
	StructuralConnectionHandler structuralConnectionHandler,
	IList<Subelement> subelements
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")>
Public Shared Sub RemoveMainSubelementsFromCustomConnection (
	structuralConnectionHandler As StructuralConnectionHandler,
	subelements As IList(Of Subelement)
)
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")]
static void RemoveMainSubelementsFromCustomConnection(
	StructuralConnectionHandler^ structuralConnectionHandler,
	IList<Subelement^>^ subelements
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")>]
static member RemoveMainSubelementsFromCustomConnection :
        structuralConnectionHandler : StructuralConnectionHandler *
        subelements : IList<Subelement> -> unit
```

#### Parameters

structuralConnectionHandler StructuralConnectionHandler

subelements IListSubelement

#### Reference

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace